In [2]:
import pandas as pd
d=pd.read_csv("C:/Users/Admin/Desktop/students.csv")
print(d)

   roll no    name  marks  age
0       201    jay    100   21
1       455   danu     98   33
2       223  laxmi     78   44
3       920   ammu     90   22

In [3]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   roll no   4 non-null      int64
 1   name      4 non-null      object
 2   marks     4 non-null      int64
 3   age       4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [4]:
m=d.astype(str)

In [5]:
print(m.dtypes)

roll no     object
name        object
marks       object
age         object
dtype: object

In [7]:
d.dtypes

roll no      int64
name        object
marks        int64
age          int64
dtype: object

In [12]:
n=d.rename({'roll no':'id','name':'peru'},axis=1)
print(n)

   roll no    peru  marks  age
0       201    jay    100   21
1       455   danu     98   33
2       223  laxmi     78   44
3       920   ammu     90   22

#

In [14]:
n=d.set_axis(['id','std name','score','years'],axis=1)
n

    id std name  score  years
0  201      jay    100     21
1  455     danu     98     33
2  223    laxmi     78     44
3  920     ammu     90     22

In [26]:
import pandas as pd
data=pd.DataFrame({"name":['arun','jayanth','dhanu','chand'],
                  "age":['nan',220,22,34],
                  "id":[221,920,'nan',238],
                  "marks":[77,'nan',66,89]})
data

      name  age   id marks
0     arun  nan  221    77
1  jayanth  220  920   nan
2    dhanu   22  nan    66
3    chand   34  238    89

In [27]:
data.dropna()

      name  age   id marks
0     arun  nan  221    77
1  jayanth  220  920   nan
2    dhanu   22  nan    66
3    chand   34  238    89

In [28]:
data.dropna(axis='columns')

      name  age   id marks
0     arun  nan  221    77
1  jayanth  220  920   nan
2    dhanu   22  nan    66
3    chand   34  238    89

In [30]:
data.dropna(thresh=2)

      name  age   id marks
0     arun  nan  221    77
1  jayanth  220  920   nan
2    dhanu   22  nan    66
3    chand   34  238    89